# <font color='#d50283'>IT Academy - Data Science</font>
##  S13 T02: Base de dades MySQL
### Luis Ortas

In [1]:
from IPython.display import Image
import mysql.connector
from mysql.connector import Error
import pandas as pd

import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
#pip install mysql-connector-python

***
### Exercici 1
Crea una base de dades relacionals senzilla utilitzant MySQL(https://www.mysql.com/) i connecta-la a Python

In [3]:
db = mysql.connector.connect(
     host="localhost",
     user="root",
     password="2323")

print(db)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002046C5377C0>

In [4]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="2323"
)

mycursor = mydb.cursor()

In [5]:
mycursor.execute("SHOW DATABASES")

for x in mycursor:
  print(x)

('information_schema',)
('mibasedatos',)
('mydabase',)
('mydatabase1',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [6]:
 database="sakila"

In [7]:
mycursor

In [8]:
#crear base de datos

mycursor = db.cursor()
mycursor.execute("DROP DATABASE IF EXISTS MiBaseDatos")
mycursor.execute("CREATE DATABASE MiBaseDatos")
mycursor.execute("SHOW DATABASES")
for x in mycursor:
    print(x)

('information_schema',)
('mibasedatos',)
('mydabase',)
('mydatabase1',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [9]:
#Creando tablas
mycursor.execute("USE MiBaseDatos")

# Establecimiento
mycursor.execute("DROP TABLE IF EXISTS establecimiento")
mycursor.execute("""CREATE TABLE establecimiento 
                (EstablecimientoID INT AUTO_INCREMENT PRIMARY KEY,
                 Nombre VARCHAR(255), 
                Localizacion VARCHAR(255), 
                Area FLOAT)""")

#Empleado
mycursor.execute("DROP TABLE IF EXISTS empleado")
mycursor.execute("""CREATE TABLE empleado 
                (EmpleadoID INT AUTO_INCREMENT PRIMARY KEY,
                 DNI VARCHAR(255), 
                Nombre VARCHAR(255), 
                Apellidos VARCHAR(255),
                categoria VARCHAR(255),
              
                EstablecimientoID INT)""")


#Producto
mycursor.execute("DROP TABLE IF EXISTS producto")
mycursor.execute("""CREATE TABLE producto 
                (ProductoID INT AUTO_INCREMENT PRIMARY KEY,
                PVP FLOAT, 
                Departamento VARCHAR(255), 
                
                EstablecimientoID INT,
                Referencia INT)""")
#Referencia
mycursor.execute("DROP TABLE IF EXISTS referencia")
mycursor.execute("""CREATE TABLE referencia 
                (Referencia INT AUTO_INCREMENT PRIMARY KEY,
                Nombre VARCHAR(255),
                Descripcion VARCHAR(255),
                PrecioMin FLOAT)""")

#Transacion
mycursor.execute("DROP TABLE IF EXISTS transacion")
mycursor.execute("""CREATE TABLE transacion 
                (TransacionID INT AUTO_INCREMENT PRIMARY KEY,
                EstablecimientoID INT,
                EmpleadoID INT,
                ProductoID INT)""")

mycursor.execute("SHOW TABLES")
for x in mycursor:
    print(x)

('empleado',)
('establecimiento',)
('producto',)
('referencia',)
('transacion',)

In [10]:
#foreign keys

mycursor.execute("USE MiBaseDatos")

mycursor.execute("""ALTER TABLE empleado ADD FOREIGN KEY (EstablecimientoID) REFERENCES establecimiento(EstablecimientoID)""")
mycursor.execute("""ALTER TABLE producto ADD FOREIGN KEY (EstablecimientoID) REFERENCES  establecimiento(EstablecimientoID)""")
mycursor.execute("""ALTER TABLE producto ADD FOREIGN KEY (Referencia) REFERENCES referencia(Referencia)""")

mycursor.execute("""ALTER TABLE transacion ADD FOREIGN KEY (EstablecimientoID) REFERENCES establecimiento(EstablecimientoID)""")
mycursor.execute("""ALTER TABLE transacion ADD FOREIGN KEY (ProductoID) REFERENCES producto(ProductoID)""")
mycursor.execute("""ALTER TABLE transacion ADD FOREIGN KEY (EmpleadoID) REFERENCES empleado(EmpleadoID)""")

In [11]:
## insertando valores
sql = "INSERT INTO Establecimiento (Nombre, Localizacion, Area) VALUES (%s, %s, %s)"
val = [("Local 1", "C/ y coma 1", "100"),
      ("Local 2", "C/ de los olvidos 2 ", "100"),
      ("Local 3", "C/ de los establecimientos 3", "300"),
      ("Local 4", "C/ de los establecimientos 4", "400")]
mycursor.executemany(sql, val)
db.commit()
print(mycursor.rowcount, "registros insertados")

4 registros insertados

In [12]:
#Imprimir los valores de establecimiento.
mycursor.execute("SELECT * FROM establecimiento")
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

(1, 'Local 1', 'C/ y coma 1', 100.0)
(2, 'Local 2', 'C/ de los olvidos 2 ', 100.0)
(3, 'Local 3', 'C/ de los establecimientos 3', 300.0)
(4, 'Local 4', 'C/ de los establecimientos 4', 400.0)

In [13]:
# Insertando valores de empeleados           
sql = "INSERT INTO empleado (Nombre, Apellidos, DNI,Categoria, EstablecimientoID) VALUES (%s, %s, %s, %s,%s)"
val = [("Maria","Garcia Martinez","99999999K","Jefe","1"),
       ("Marip","Perez Lopez","99999779K","Director","1"),
      ("Irene","Lopez Martin","88888888K","Cajero","2"),
      ("Carles","Diaz Romero","77777777K","Jefe","3"),
      ("Pepe","Alcala Romero","777ssss77K","Machaca","4")]
mycursor.executemany(sql, val)
db.commit()
print(mycursor.rowcount, "Registros insertados")

5 Registros insertados

In [14]:
#Imprimir los valores de empleados.
mycursor.execute("SELECT * FROM empleado")
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

(1, '99999999K', 'Maria', 'Garcia Martinez', 'Jefe', 1)
(2, '99999779K', 'Marip', 'Perez Lopez', 'Director', 1)
(3, '88888888K', 'Irene', 'Lopez Martin', 'Cajero', 2)
(4, '77777777K', 'Carles', 'Diaz Romero', 'Jefe', 3)
(5, '777ssss77K', 'Pepe', 'Alcala Romero', 'Machaca', 4)

In [15]:
# Insertando valores de referencia           
sql = "INSERT INTO referencia (Nombre, Descripcion, PrecioMin) VALUES (%s, %s, %s)"
val = [("Tazas","6 tazas de cafe","20.5"),
       ("Vasos","6 vasos 25cm","18.5"),
      ("Platos","6 platos","20.5"),
      ("Tenedores","36 tenedores","15.5"),
       ("cucharas","36 cucharas","16.0"),
       ("Cuchilloss","36 cuchillos","17")]
mycursor.executemany(sql, val)
db.commit()
print(mycursor.rowcount, "Registros insertados")

6 Registros insertados

In [16]:
#Imprimir los valores de empleados.
mycursor.execute("SELECT * FROM referencia")
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

(1, 'Tazas', '6 tazas de cafe', 20.5)
(2, 'Vasos', '6 vasos 25cm', 18.5)
(3, 'Platos', '6 platos', 20.5)
(4, 'Tenedores', '36 tenedores', 15.5)
(5, 'cucharas', '36 cucharas', 16.0)
(6, 'Cuchilloss', '36 cuchillos', 17.0)

In [17]:
# Insertando valores de producto         
sql = "INSERT INTO producto (Referencia, EstablecimientoID, PVP, Departamento) VALUES (%s, %s, %s,%s)"

val = [("1","1","21.5","Menaje"),
       ("2","1","21.5","Menaje"),
       ("3","1","21.5","Menaje"),
       ("4","1","21.5","Menaje"),
       
       ("1","2","22","Menaje"),
       ("2","2","22","Menaje"),
       ("3","2","22","Menaje"),
       ("4","2","22","Menaje"),
       
        ("1","3","22","Menaje"),
        ("2","3","22","Menaje"),
       ("3","3","22","Menaje"),
       ("4","3","22","Menaje"),
       ("5","3","22","Menaje"),
       ("6","3","22","Menaje"),
      
        ("1","4","22","Menaje"),
        ("2","4","22","Menaje"),
       ("3","4","22","Menaje"),
       ("4","4","22","Menaje"),
       ("5","4","22","Menaje"),
       ("6","4","22","Menaje"),]

              
mycursor.executemany(sql, val)
db.commit()
print(mycursor.rowcount, "Registros insertados")

20 Registros insertados

In [18]:
#Imprimir los valores de empleados.
mycursor.execute("SELECT * FROM producto")
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

(1, 21.5, 'Menaje', 1, 1)
(2, 21.5, 'Menaje', 1, 2)
(3, 21.5, 'Menaje', 1, 3)
(4, 21.5, 'Menaje', 1, 4)
(5, 22.0, 'Menaje', 2, 1)
(6, 22.0, 'Menaje', 2, 2)
(7, 22.0, 'Menaje', 2, 3)
(8, 22.0, 'Menaje', 2, 4)
(9, 22.0, 'Menaje', 3, 1)
(10, 22.0, 'Menaje', 3, 2)
(11, 22.0, 'Menaje', 3, 3)
(12, 22.0, 'Menaje', 3, 4)
(13, 22.0, 'Menaje', 3, 5)
(14, 22.0, 'Menaje', 3, 6)
(15, 22.0, 'Menaje', 4, 1)
(16, 22.0, 'Menaje', 4, 2)
(17, 22.0, 'Menaje', 4, 3)
(18, 22.0, 'Menaje', 4, 4)
(19, 22.0, 'Menaje', 4, 5)
(20, 22.0, 'Menaje', 4, 6)

In [19]:
sql = "INSERT INTO transacion ( EstablecimientoID, EmpleadoID,ProductoID) VALUES (%s, %s, %s)"
values=[("1","1","1"),
       ("1","1","2"),
       ("1","2","3"),
       ("1","2","4"),
        
        ("2","3","5"),
       ("2","3","6"),
       ("2","3","7"),
       ("2","3","8"),
        
        ("3","4","9"),
       ("3","4","10"),
       ("3","4","11"),
       ("3","4","12"),
        
        ("4","5","13"),
       ("4","5","14"),
       ("4","5","15"),
       ("4","5","16")
        
        ]
       

mycursor.executemany(sql, values)

db.commit()
print(mycursor.rowcount, "Registros insertados")

16 Registros insertados

In [20]:
#Imprimir los valores de empleados.
mycursor.execute("SELECT * FROM transacion")
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

(1, 1, 1, 1)
(2, 1, 1, 2)
(3, 1, 2, 3)
(4, 1, 2, 4)
(5, 2, 3, 5)
(6, 2, 3, 6)
(7, 2, 3, 7)
(8, 2, 3, 8)
(9, 3, 4, 9)
(10, 3, 4, 10)
(11, 3, 4, 11)
(12, 3, 4, 12)
(13, 4, 5, 13)
(14, 4, 5, 14)
(15, 4, 5, 15)
(16, 4, 5, 16)

***

### Exercici 2
Mostra que pots carregar algunes consultes senzilles a un Pandas Dataframe.

In [21]:
# Listado de Establecimientos

try:
    db = mysql.connector.connect(host="localhost", database = 'mibasedatos',user="root", passwd="2323",use_pure=True)
    query = "SELECT * FROM establecimiento;"
    enterprise_dataFrame = pd.read_sql(query,db)
except Exception as e:
    db.close()
    print(str(e))

In [22]:
 enterprise_dataFrame

   EstablecimientoID   Nombre                  Localizacion   Area
0                  1  Local 1                   C/ y coma 1  100.0
1                  2  Local 2          C/ de los olvidos 2   100.0
2                  3  Local 3  C/ de los establecimientos 3  300.0
3                  4  Local 4  C/ de los establecimientos 4  400.0

In [23]:
# Creamos tabla ordenada del total de ventas por empleaado
try:
    db = mysql.connector.connect(host="localhost", database = 'mibasedatos',user="root", passwd="2323",use_pure=True)
    query = """SELECT empleado.Nombre, empleado.Apellidos, sum(producto.PVP) AS Ventas_totales
FROM ((empleado
INNER JOIN transacion ON empleado.EmpleadoID=transacion.EmpleadoID)
INNER JOIN producto ON transacion.ProductoID=producto.ProductoID)
GROUP BY empleado.Nombre
ORDER BY Ventas_Totales DESC;"""
    Total_Ventas_df = pd.read_sql(query,db)
except Exception as e:
    db.close()
    print(str(e))

In [24]:
Total_Ventas_df

   Nombre        Apellidos  Ventas_totales
0   Irene     Lopez Martin            88.0
1  Carles      Diaz Romero            88.0
2    Pepe    Alcala Romero            88.0
3   Maria  Garcia Martinez            43.0
4   Marip      Perez Lopez            43.0

In [25]:
# A que precio se ha vendido la referencia 1 y donde?

try:
    db = mysql.connector.connect(host="localhost", database = 'mibasedatos',user="root", passwd="2323",use_pure=True)
    query = """SELECT establecimiento.Nombre, establecimiento.Localizacion, referencia.Referencia,referencia.Nombre,producto.PVP
FROM(((establecimiento
INNER JOIN transacion ON establecimiento.EstablecimientoID=transacion.EstablecimientoID)
INNER JOIN producto ON transacion.ProductoID=producto.ProductoID)
INNER JOIN referencia ON producto.Referencia=referencia.Referencia)
WHERE referencia.Referencia="1";"""
    Ref1_df = pd.read_sql(query,db)
except Exception as e:
    db.close()
    print(str(e))

In [26]:
  Ref1_df

    Nombre                  Localizacion  Referencia Nombre   PVP
0  Local 1                   C/ y coma 1           1  Tazas  21.5
1  Local 2          C/ de los olvidos 2            1  Tazas  22.0
2  Local 3  C/ de los establecimientos 3           1  Tazas  22.0
3  Local 4  C/ de los establecimientos 4           1  Tazas  22.0

In [27]:
# Ventas por empleado con numero de referencias y productos


try:
    db = mysql.connector.connect(host="localhost", database = 'mibasedatos',user="root", passwd="2323",use_pure=True)
    query = """SELECT empleado.Nombre, empleado.Apellidos,count(referencia.Referencia) as Num_ref, count(producto.ProductoID) as Num_produc, sum(producto.PVP) AS Ventas_totales
FROM (((empleado
INNER JOIN transacion ON empleado.EmpleadoID=transacion.EmpleadoID)
INNER JOIN producto ON transacion.ProductoID=producto.ProductoID)
INNER JOIN referencia ON producto.Referencia=referencia.Referencia)
group by empleado.Nombre
ORDER BY Ventas_Totales DESC;"""
    refyprodu_df = pd.read_sql(query,db)
except Exception as e:
    db.close()
    print(str(e))

In [28]:
refyprodu_df

   Nombre        Apellidos  Num_ref  Num_produc  Ventas_totales
0   Irene     Lopez Martin        4           4            88.0
1  Carles      Diaz Romero        4           4            88.0
2    Pepe    Alcala Romero        4           4            88.0
3   Maria  Garcia Martinez        2           2            43.0
4   Marip      Perez Lopez        2           2            43.0

In [29]:
#Ventas por empleado con numero de referencias y productos. 
# Empleado que haya vendido mÃ¡s de dos referencias diferentes.
try:
    db = mysql.connector.connect(host="localhost", database = 'mibasedatos',user="root", passwd="2323",use_pure=True)
    query = """SELECT empleado.Nombre, empleado.Apellidos,count(referencia.Referencia) as Num_ref, count(producto.ProductoID) as Num_produc, sum(producto.PVP) AS Ventas_totales
FROM (((empleado
INNER JOIN transacion ON empleado.EmpleadoID=transacion.EmpleadoID)
INNER JOIN producto ON transacion.ProductoID=producto.ProductoID)
INNER JOIN referencia ON producto.Referencia=referencia.Referencia)
group by empleado.Nombre
HAVING Num_ref>"2"
ORDER BY Ventas_Totales DESC;"""
    Ventas_num_ref_df = pd.read_sql(query,db)
except Exception as e:
    db.close()
    print(str(e))

In [30]:
 Ventas_num_ref_df

   Nombre      Apellidos  Num_ref  Num_produc  Ventas_totales
0   Irene   Lopez Martin        4           4            88.0
1  Carles    Diaz Romero        4           4            88.0
2    Pepe  Alcala Romero        4           4            88.0

***